---
kind: method
id: M:Autodesk.Revit.DB.FamilyElementVisibility.#ctor(Autodesk.Revit.DB.FamilyElementVisibilityType)
source: html/28608cbc-5b9d-b257-4cc1-0b52bd57a93b.htm
---
# Autodesk.Revit.DB.FamilyElementVisibility.#ctor Method

Initializes a new instance of the FamilyElementVisibility class

## Syntax (C#)
```csharp
public FamilyElementVisibility(
	FamilyElementVisibilityType visibilityType
)
```

## Parameters
- **visibilityType** (`Autodesk.Revit.DB.FamilyElementVisibilityType`)